
## Plan Result (portfolio/terraform_vercel)

[CI link](https://github.com/tqer39/terraform-aws/actions/runs/5012176648)


<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.deploy_role.aws_iam_policy.this
  * module.deploy_role.aws_iam_role.this


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.deploy_role.aws_iam_policy.this will be created
  + resource "aws_iam_policy" "this" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "portfolio-terraform-vercel-deploy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:PutObject",
                          + "s3:GetObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::terraform-tfstate-tqer39-072693953877-ap-northeast-1/terraform-vercel/*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "pl:environment" = "portfolio"
          + "pl:iac"         = "terraform"
          + "pl:owner"       = "tqer39+aws-portfolio@gmail.com"
          + "pl:product"     = "terraform-aws"
          + "pl:repository"  = "tqer39/terraform-aws"
          + "pl:source_path" = "./terraform/environments/portfolio/terraform_vercel"
        }
    }

  # module.deploy_role.aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringLike = {
                              + "token.actions.githubusercontent.com:sub" = "repo:tqer39/terraform-vercel:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::072693953877:oidc-provider/token.actions.githubusercontent.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "portfolio-terraform-vercel-deploy"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = {
          + "pl:environment" = "portfolio"
          + "pl:iac"         = "terraform"
          + "pl:owner"       = "tqer39+aws-portfolio@gmail.com"
          + "pl:product"     = "terraform-aws"
          + "pl:repository"  = "tqer39/terraform-aws"
          + "pl:source_path" = "./terraform/environments/portfolio/terraform_vercel"
        }
      + unique_id             = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":282,"Program":"tfcmt","SHA1":"5a6bbe1fa51ce9ef9a9515551e145aada0fa9336","Target":"portfolio/terraform_vercel","Vars":{},"WorkflowName":"Terraform - AWS - Portfolio"} -->